1c_config/Documents/ПобедаВСудоку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПобедаВСудоку</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИгрока</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИгры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПобеды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c_config/Catalogs/ПользователиИгры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПользователиИгры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c_config/HTTPServices/sudoku/Ext/Module.bsl
// --- ОБРАБОТЧИКИ ДЛЯ ПОЛЬЗОВАТЕЛЕЙ ---
                                                        
// Обработчик для GET /hs/sudoku/users/{username} (Получение данных для входа)         
Функция ПолучитьДанныеПользователя(Запрос) Экспорт
                                                            
    Перем АйдиПользователя, ЛогинПользователя, ХэшПароляПользователя;
    ИмяПользователя = Запрос.ПараметрыURL.Получить("username");
    
    ЗапросБД = Новый Запрос;
    ЗапросБД.Текст = 
        "ВЫБРАТЬ
        |   ПользователиИгры.Ссылка,
        |   ПользователиИгры.Логин,
        |   ПользователиИгры.ХэшПароля
        |ИЗ
        |   Справочник.ПользователиИгры КАК ПользователиИгры
        |ГДЕ
        |   ПользователиИгры.Логин = &Логин";
    ЗапросБД.УстановитьПараметр("Логин", ИмяПользователя);
    
    РезультатЗапроса = ЗапросБД.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат СформироватьОтветС_Ошибкой(404, "Пользователь не найден");
    КонецЕсли;
    
    Выборка = РезультатЗапроса.Выбрать();
    Выборка.Следующий();
    
    // --- НАЧАЛО ИСПРАВЛЕНИЙ ---
    // Шаг 1: Объявляем все переменные                                

    // Шаг 2: Присваиваем значения на отдельных строках
    АйдиПользователя = XMLСтрока(Выборка.Ссылка.УникальныйИдентификатор());
    ЛогинПользователя = XMLСтрока(Выборка.Логин);
    ХэшПароляПользователя = Base64Строка(Выборка.ХэшПароля);
    // --- КОНЕЦ ИСПРАВЛЕНИЙ ---
    
    // Шаг 3: Создаем структуру и наполняем ее из наших переменных
    ДанныеПользователя = Новый Структура;
    ДанныеПользователя.Вставить("id",            АйдиПользователя);
    ДанныеПользователя.Вставить("username",      ЛогинПользователя);
    ДанныеПользователя.Вставить("password_hash", ХэшПароляПользователя);
    
    Возврат СформироватьОтветС_Данными(200, ДанныеПользователя);

КонецФункции// --- ОБРАБОТЧИКИ ДЛЯ ПОБЕД ---

// Обработчик для POST /hs/sudoku/wins (Сохранение победы)
Функция СохранитьПобеду(Запрос) Экспорт

    Данные = ПолучитьДанныеИзJSON(Запрос);
    Если Данные = Неопределено Тогда
        Возврат СформироватьОтветС_Ошибкой(400, "Некорректный JSON");
    КонецЕсли;
    
    // --- НАЧАЛО ИЗМЕНЕНИЙ ---
    // Находим ссылку на пользователя по его логину
    СсылкаНаИгрока = Справочники.ПользователиИгры.НайтиПоРеквизиту("Логин", Данные.playerName);
    
    // Проверяем, найден ли игрок
    Если СсылкаНаИгрока.Пустая() Тогда
        Возврат СформироватьОтветС_Ошибкой(404, "Игрок с именем '" + Данные.playerName + "' не найден");
    КонецЕсли;
    // --- КОНЕЦ ИЗМЕНЕНИЙ ---
    
    Попытка
        НовыйДокумент = Документы.ПобедаВСудоку.СоздатьДокумент();
        НовыйДокумент.Дата = ТекущаяДата();
        НовыйДокумент.Игрок = СсылкаНаИгрока; // <-- ИЗМЕНЕНИЕ: Записываем ссылку, а не строку
        НовыйДокумент.ДатаПобеды = Дата(Данные.solvedAt);
        НовыйДокумент.Записать();
    Исключение
        Возврат СформироватьОтветС_Ошибкой(500, "Ошибка записи документа: " + ОписаниеОшибки());
    КонецПопытки;
        
    СтруктураОтвета = Новый Структура("message", "Победа успешно сохранена");
    Возврат СформироватьОтветС_Данными(200, СтруктураОтвета);

КонецФункции

// Обработчик для GET /hs/sudoku/wins?username=...
Функция ПолучитьПобедыПользователя(Запрос) Экспорт
    
    ИмяИгрока = Запрос.ПараметрыЗапроса.Получить("username");
    
    // ... код поиска ссылки на игрока, как выше ...
    СсылкаНаИгрока = Справочники.ПользователиИгры.НайтиПоРеквизиту("Логин", ИмяИгрока);
    Если СсылкаНаИгрока.Пустая() Тогда
        // Если игрок не найден, возвращаем просто пустой массив побед
        Возврат СформироватьОтветС_Данными(200, Новый Массив);
    КонецЕсли;
    
    ЗапросБД = Новый Запрос;
    ЗапросБД.Текст = 
        "ВЫБРАТЬ
        |   ПобедаВСудоку.ДатаПобеды КАК solvedAt
        |ИЗ
        |   Документ.ПобедаВСудоку КАК ПобедаВСудоку
        |ГДЕ
        |   ПобедаВСудоку.Игрок = &Игрок // <-- ИЗМЕНЕНИЕ: Сравниваем по ссылке
        |
        |УПОРЯДОЧИТЬ ПО
        |   solvedAt УБЫВ";
        
    ЗапросБД.УстановитьПараметр("Игрок", СсылкаНаИгрока);
    
    Результат = ЗапросБД.Выполнить().Выгрузить();
    Возврат СформироватьОтветС_Данными(200, Результат.ВыгрузитьКолонку("solvedAt"));

КонецФункции


// --- ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ ---

Функция ПолучитьДанныеИзJSON(Запрос)
    Попытка
        ЧтениеJSON = Новый ЧтениеJSON;
        ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
        Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
        ЧтениеJSON.Закрыть();
        Возврат Данные;
    Исключение
        Возврат Неопределено;
    КонецПопытки;
КонецФункции

Функция СформироватьОтветС_Данными(КодСостояния, Данные)
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Данные);
    
    Ответ = Новый HTTPСервисОтвет(КодСостояния);
    Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
    Ответ.Заголовки.Вставить("Content-type", "application/json");
    
    Возврат Ответ;
КонецФункции

Функция СформироватьОтветС_Ошибкой(КодСостояния, ТекстОшибки)
    СтруктураОшибки = Новый Структура("error", ТекстОшибки);
    Возврат СформироватьОтветС_Данными(КодСостояния, СтруктураОшибки);
КонецФункции 
// --- УПРОЩЕННЫЙ КОД МОДУЛЯ ДЛЯ ТЕСТА ---

// Обработчик для POST /hs/sudoku/users (Регистрация)
Функция СоздатьПользователя(Запрос) Экспорт
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
    Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
    ЧтениеJSON.Закрыть();

    // --- НАЧАЛО ИСПРАВЛЕНИЙ ---
    // Используем синтаксис с квадратными скобками, который работает для "Соответствия"
    ИмяПользователя = Данные["username"];
    ХэшПароля = Данные["password_hash"];
    // --- КОНЕЦ ИСПРАВЛЕНИЙ ---

    НовыйПользователь = Справочники.ПользователиИгры.СоздатьЭлемент();
    НовыйПользователь.Наименование = "Игрок " + ИмяПользователя;
    НовыйПользователь.Логин = ИмяПользователя;
    НовыйПользователь.ХэшПароля = ХэшПароля;
    НовыйПользователь.Записать();
    
    Ответ = Новый HTTPСервисОтвет(201);
    Возврат Ответ;
КонецФункции

// Обработчик для GET /hs/sudoku/users/{username} (Получение данных для входа)
//Функция ПолучитьДанныеПользователя(Запрос) Экспорт
//    ИмяПользователя = Запрос.ПараметрыURL.Получить("username");
//    
//    ЗапросБД = Новый Запрос;
//    ЗапросБД.Текст = 
//        "ВЫБРАТЬ
//        |   ПользователиИгры.ХэшПароля
//        |ИЗ
//        |   Справочник.ПользователиИгры КАК ПользователиИгры
//        |ГДЕ
//        |   ПользователиИгры.Логин = &Логин";
//    ЗапросБД.УстановитьПараметр("Логин", ИмяПользователя);
//    
//    Результат = ЗапросБД.Выполнить().Выгрузить();
//    
//    Если Результат.Количество() = 0 Тогда
//        Ответ = Новый HTTPСервисОтвет(404);
//        Возврат Ответ;
//    КонецЕсли;
//    
//    ХэшПароля = Результат[0].ХэшПароля;
//    
//    // Просто возвращаем хэш в виде простого текста, без JSON
//    Ответ = Новый HTTPСервисОтвет(200);
//    Ответ.УстановитьТелоИзСтроки(ХэшПароля);
//    Ответ.Заголовки.Вставить("Content-type", "text/plain");
//    
//    Возврат Ответ;
//КонецФункции
